[
  {
    "Title": "C#",
    "FirstDescription": "C# é uma linguagem de programação, desenvolvida pela Microsoft como parte da plataforma .NET",
    "SecondDescription": "A línguagem que estudo desde o começo na faculdade e a que mais utilizo no mercado atualmente, me sinto confortável em dizer que é a com mais experiência e expertise atuando em diversos projetos.",
    "FilePathImage": "csharp.png",
    "StackId": 1
  },
  {
    "Title": ".NET Core",
    "FirstDescription": ".NET Core é um framework livre e de código aberto para os sistemas operacionais Windows, Linux e macOS. É um sucessor de código aberto do .NET Framework.",
    "SecondDescription": "Conjunto de ferramentas .NET é onde tenho minha maior base de conhecimento e apliquei soluções mais complexas.",
    "FilePathImage": "netCoreIcon.png",
    "StackId": 2
  },
  {
    "Title": ".NET Framework",
    "FirstDescription": "O .NET Framework é uma iniciativa da empresa Microsoft, que visa uma plataforma única para desenvolvimento e execução de sistemas e aplicações. Todo e qualquer código gerado para .NET pode ser executado em qualquer dispositivo que possua um framework de tal plataforma.",
    "SecondDescription": "Conjunto de ferramentas .NET é onde tenho minha maior base de conhecimento e apliquei soluções mais complexas.",
    "FilePathImage": "netIcon.png",
    "StackId": 2
  },
  {
    "Title": "JavaScript",
    "FirstDescription": "JavaScript é uma linguagem de programação interpretada estruturada, Juntamente com HTML e CSS, o JavaScript é uma das três principais tecnologias da World Wide Web.",
    "SecondDescription": "Linguagem a qual me sinto confortavel em prestar manutenção ou criar algum script para alguma necessidade web",
    "FilePathImage": "javaScript.png",
    "StackId": 1
  },
  {
    "Title": "TypeScript",
    "FirstDescription": "TypeScript é um superconjunto de JavaScript desenvolvido pela Microsoft que adiciona tipagem e alguns outros recursos a linguagem. Anders Hejlsberg, arquiteto da linguagem C# e criador das linguagens Delphi e Turbo Pascal, trabalhou no desenvolvimento do TypeScript.",
    "SecondDescription": "Sigo da mesma maneira do JavaScript com relação ao TypeScript, já que comecei a imersão em frameworks front-end antes fui atrás de estudar um pouco sobre TS.",
    "FilePathImage": "typescript.png",
    "StackId": 1
  },
  {
    "Title": "JQuery",
    "FirstDescription": "JQuery é uma biblioteca de funções JavaScript que interage com o HTML, desenvolvida para simplificar os scripts interpretados no navegador do cliente.",
    "SecondDescription": "Tenho bastante conhecimento em tal framework já que no meu início de carreira foi o que mais utilizei para auxiliar no front-end.",
    "FilePathImage": "jquery.png",
    "StackId": 3
  },
  {
    "Title": "Bootstrap",
    "FirstDescription": "Bootstrap é um framework web com código-fonte aberto para desenvolvimento de componentes de interface e front-end para sites e aplicações web usando HTML, CSS e JavaScript.",
    "SecondDescription": "Tenho um bom conhecimento por ser uma ferramenta que normalmente utilizo quando necessito criar uma página do \"zero\" para acelerar o processo de desenvolvimento, então me sinto confortável para trabalhar com a mesma.",
    "FilePathImage": "bootstrap.png",
    "StackId": 3
  },
  {
    "Title": "Azure",
    "FirstDescription": "O Microsoft Azure é uma plataforma destinada à execução de aplicativos e serviços, baseada nos conceitos da computação em nuvem.",
    "SecondDescription": "Ferramenta que conheço mais sobre, já que utilizo muito atualmente, alguns dos meus projetos antigos eram armazenados na App Services, além de utilizarem o SQL no Azure, Blobs para armazenamento, e CDN para a página estática.",
    "FilePathImage": "azure.png",
    "StackId": 7
  },
  {
    "Title": "AWS",
    "FirstDescription": "Amazon Web Services, também conhecido como AWS, é uma plataforma de serviços de computação em nuvem, que formam uma plataforma de computação na nuvem oferecida pela Amazon.com. Os serviços são oferecidos em várias áreas geográficas distribuídas pelo mundo.",
    "SecondDescription": "Ferramenta que venho me aprimorando sobre, apesar de utilizar seus produtos em projetos de clientes não tenho uma grande expertise como a Azure.",
    "FilePathImage": "aws.png",
    "StackId": 7
  },
  {
    "Title": "SQL Server",
    "FirstDescription": "O Microsoft SQL Server é um sistema gerenciador de Banco de dados relacional desenvolvido pela Sybase em parceria com a Microsoft. Esta parceria durou até 1994, com o lançamento da versão para Windows NT e desde então a Microsoft mantém a manutenção do produto.",
    "SecondDescription": "Banco de dados ao qual tenho mais conhecimento, estudo e utilizo o mesmo desce o início da minha jornada com DBs.",
    "FilePathImage": "sqlServer.png",
    "StackId": 4
  },
  {
    "Title": "MySQL",
    "FirstDescription": "O MySQL é um sistema de gerenciamento de banco de dados, que utiliza a linguagem SQL como interface. É atualmente um dos sistemas de gerenciamento de bancos de dados mais populares da Oracle Corporation, com mais de 10 milhões de instalações pelo mundo.",
    "SecondDescription": "Banco de dados que comecei a utilizar com mais frequencia recentemente para poder reduzir custos nos projetos que participei.",
    "FilePathImage": "mysql.png",
    "StackId": 4
  },
  {
    "Title": "Oracle Database",
    "FirstDescription": "O Oracle é um SGBD que surgiu no fim dos anos 70, quando Larry Ellison vislumbrou uma oportunidade que outras companhias não haviam percebido, quando encontrou uma descrição de um protótipo funcional de um banco de dados relacional e descobriu que nenhuma empresa tinha se empenhado em comercializar essa tecnologia.",
    "SecondDescription": "Banco de dados que comecei a utilizar com mais frequencia recentemente já que muitos projetos legados de alguns clientes utilizavam este banco de dados.",
    "FilePathImage": "oracleDb.png",
    "StackId": 4
  },
  {
    "Title": "Git",
    "FirstDescription": "Git é um sistema de controle de versões distribuído, usado principalmente no desenvolvimento de software, mas pode ser usado para registrar o histórico de edições de qualquer tipo de arquivo.",
    "SecondDescription": "O sistema de versionamento ao qual estou habituado a trabalhar, sempre utilizei o Git, e fiz o versionamento ou pelo GitHub ou GitLab.",
    "FilePathImage": "git.png",
    "StackId": 6
  },
  {
    "Title": "Angular",
    "FirstDescription": "Angular é uma plataforma de aplicações web de código-fonte aberto e front-end baseado em TypeScript liderado pela Equipe Angular do Google e por uma comunidade de indivíduos e corporações. Angular é uma reescrita completa do AngularJS, feito pela mesma equipe que o construiu.",
    "SecondDescription": "Framework front-end que tenho mais experiência, atualmente consigo construir aplicações com certo nível de complexidade com esta ferramenta.",
    "FilePathImage": "angular.png",
    "StackId": 3
  },
  {
    "Title": "ReactJS",
    "FirstDescription": "O React é uma biblioteca JavaScript de código aberto com foco em criar interfaces de usuário em páginas web. É mantido pelo Facebook, Instagram, outras empresas e uma comunidade de desenvolvedores individuais. É utilizado nos sites da Netflix, Imgur, Feedly, Airbnb, SeatGeek, HelloSign, Walmart e outros.",
    "SecondDescription": "Framework front-end ao qual venho estudando e ganhando cada vez mais experiência, atualmente consigo construir aplicações para necessidades simples.",
    "FilePathImage": "reactjs.png",
    "StackId": 3
  },
  {
    "Title": "Azure Pipelines",
    "FirstDescription": "Azure Pipelines cria e testa automaticamente projetos de código para torná-los disponíveis para outras pessoas. Ele funciona com praticamente qualquer linguagem ou tipo de projeto. Azure Pipelines combina CI (integração contínua) e CD (entrega contínua) para testar e criar seu código e enviar para qualquer destino.",
    "SecondDescription": "Tenho certo conhecimento já que utilizei do mesmo para fazer deploy de projetos simples que criei e utilizo na Azure.",
    "FilePathImage": "azurePipelines.png",
    "StackId": 5
  },
  {
    "Title": "GitLab CI/CD",
    "FirstDescription": "GitLab é uma plataforma de DevOps de código aberto que oferece soluções para todo o fluxo de desenvolvimento e implantação, como repositórios Git (para versionamento de código), Wikis (para gestão de conhecimento e documentação), quadros de tarefas (similar ao Jira), monitoramento e implantação.",
    "SecondDescription": "Conheço somente como utilizar por utilizar na época de estagiário, porém nunca tive a oportunidade de criar um serviço com o mesmo.",
    "FilePathImage": "gitlabcicd.png",
    "StackId": 5
  },
  {
    "Title": "Jenkins",
    "FirstDescription": "Jenkins é um servidor de automação de código aberto. Ele ajuda a automatizar as partes do desenvolvimento de software relacionadas à construção, teste e implantação, facilitando a integração e entrega contínuas. É um sistema baseado em servidor que é executado em contêineres de servlet, como o Apache Tomcat.",
    "SecondDescription": "Conheço somente como utilizar pois atuei em projetos que utilizam do mesmo junto do Bitbucket, porém nunca tive a oportunidade de criar um serviço com o mesmo.",
    "FilePathImage": "jenkins.png",
    "StackId": 5
  }
]

